Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Cfg/Ifx_FRW_ParamTable_Cfg.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

#include "string.h"
#include "Ifx_FRW_ParamTable_Cfg.h"

/* *INDENT-OFF* */
/* Application includes */
#include "ComApp.h"


/* Includes to resolve symbols used in paramTable_Table */
#include "MctrlExample.h"

/* Parameter table */
Ifx_FRW_ParamTable_paramEntry const Ifx_FRW_ParamTable_Table[IFX_FRW_PARAMTABLE_NUMPARAM] = {
    /* IDX 0x3000: Motorcontrol/g_patternGenParam/deadTime */
    {
        .index                        = 0x3000u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .uMin_DU                      = 50u,
        .uMax_DU                      = 2000u,
        .uMin_TU                      = 5u,
        .uMax_TU                      = 200u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = NULL,
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MHA_PatternGen_F16_TLE987_getDeadTime_ns,
        .setParam                     = (functionPointer)Ifx_MHA_PatternGen_F16_TLE987_setDeadTime_ns,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.patternGen)
    },
    /* IDX 0x3010: Motorcontrol/g_patternGenParam/state */
    {
        .index                        = 0x3010u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4u,
        .sMin_TU                      = 0,
        .sMax_TU                      = 4,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.patternGen.p_status.state),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.patternGen)
    },
    /* IDX 0x3100: Motorcontrol/g_measurementADCParam/csaGain */
    {
        .index                        = 0x3100u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 3u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 3u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = NULL,
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_getCsaGain,
        .setParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_setCsaGain,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3101: Motorcontrol/g_measurementADCParam/offset */
    {
        .index                        = 0x3101u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 65535u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 16384u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_offset),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_getCsaOffset,
        .setParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_setCsaOffset,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3102: Motorcontrol/g_measurementADCParam/calibrateCSA */
    {
        .index                        = 0x3102u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 65535u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 16384u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_calibrateCSA),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_getCsaOffset,
        .setParam                     = (functionPointer)Ifx_MHA_MeasurementADC_F16_TLE987_setCsaOffset,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3110: Motorcontrol/g_measurementADCParam/state */
    {
        .index                        = 0x3110u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 3u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 3u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_status.state),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3111: Motorcontrol/g_measurementADCParam/shuntCurrents_0 */
    {
        .index                        = 0x3111u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -500,
        .sMax_TU                      = 500,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_output.shuntCurrentsQ15[0]),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3112: Motorcontrol/g_measurementADCParam/shuntCurrents_1 */
    {
        .index                        = 0x3112u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -500,
        .sMax_TU                      = 500,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_output.shuntCurrentsQ15[1]),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3113: Motorcontrol/g_measurementADCParam/dcLinkVoltage */
    {
        .index                        = 0x3113u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -2400,
        .sMax_TU                      = 2400,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.measurementADC.p_output.dcLinkVoltageQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.measurementADC)
    },
    /* IDX 0x3210: Motorcontrol/g_bridgeDrvParam/state */
    {
        .index                        = 0x3210u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 3u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 3u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.bridgeDrv.p_status.state),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.bridgeDrv)
    },
    /* IDX 0x3211: Motorcontrol/g_bridgeDrvParam/error_overcurrent */
    {
        .index                        = 0x3211u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.bridgeDrv.p_status.overcurrent),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.bridgeDrv)
    },
    /* IDX 0x3212: Motorcontrol/g_bridgeDrvParam/error_overvoltage */
    {
        .index                        = 0x3212u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.bridgeDrv.p_status.overvoltage),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.bridgeDrv)
    },
    /* IDX 0x3213: Motorcontrol/g_bridgeDrvParam/error_undervoltage */
    {
        .index                        = 0x3213u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.driverGroup.bridgeDrv.p_status.undervoltage),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.driverGroup.bridgeDrv)
    },
    /* IDX 0x4000: Motorcontrol/g_modulatorParam/measurementTime */
    {
        .index                        = 0x4000u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 200,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 500u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.measurementTime_tick),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getMeasurementTime_tick,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setMeasurementTime_tick,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4001: Motorcontrol/g_modulatorParam/deadTime */
    {
        .index                        = 0x4001u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 2,
        .sMax_DU                      = 80,
        .uMin_TU                      = 5u,
        .uMax_TU                      = 200u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.deadTime_tick),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getDeadTime_tick,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setDeadTime_tick,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4002: Motorcontrol/g_modulatorParam/driverDelay */
    {
        .index                        = 0x4002u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 80,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 200u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.driverDelay_tick),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getDriverDelay_tick,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setDriverDelay_tick,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4003: Motorcontrol/g_modulatorParam/ringingTime */
    {
        .index                        = 0x4003u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 2,
        .sMax_DU                      = 80,
        .uMin_TU                      = 5u,
        .uMax_TU                      = 200u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.ringingTime_tick),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getRingingTime_tick,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setRingingTime_tick,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4004: Motorcontrol/g_modulatorParam/period */
    {
        .index                        = 0x4004u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -32768,
        .sMax_TU                      = 32767,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.period_tick),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getPeriod_tick,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setPeriod_tick,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4006: Motorcontrol/g_modulatorParam/maxAmplitude */
    {
        .index                        = 0x4006u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.maxAmplitudeQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MAS_Modulator_F16_getMaxAmplitude,
        .setParam                     = (functionPointer)Ifx_MAS_Modulator_F16_setMaxAmplitude,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4007: Motorcontrol/g_modulatorParam/biDirectionalShiftingThresholdHigh */
    {
        .index                        = 0x4007u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.biDirectionalShiftingThresholdHighQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4008: Motorcontrol/g_modulatorParam/biDirectionalShiftingThresholdLow */
    {
        .index                        = 0x4008u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_modulatorParam.biDirectionalShiftingThresholdLowQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4010: Motorcontrol/g_modulatorParam/state */
    {
        .index                        = 0x4010u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
