Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Cfg/Ifx_FRW_ParamTable_Cfg.c
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 4u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_status.state),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4011: Motorcontrol/g_modulatorParam/subState */
    {
        .index                        = 0x4011u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_status.subState),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4012: Motorcontrol/g_modulatorParam/error_maxAmplitudeFlag */
    {
        .index                        = 0x4012u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_status.maxAmplitudeFlag),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4013: Motorcontrol/g_modulatorParam/error_overmodulationFlag */
    {
        .index                        = 0x4013u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_status.overmodulationFlag),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4016: Motorcontrol/g_modulatorParam/actualVoltageAmplitude */
    {
        .index                        = 0x4016u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -2400,
        .sMax_TU                      = 2400,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_output.actualVoltage.amplitude),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4017: Motorcontrol/g_modulatorParam/actualVoltageAngle */
    {
        .index                        = 0x4017u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 62832u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_output.actualVoltage.angle),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4018: Motorcontrol/g_modulatorParam/currentReconstructionInfoSector */
    {
        .index                        = 0x4018u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 255u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 5u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_output.currentReconstructionInfo.sector),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4019: Motorcontrol/g_modulatorParam/currentReconstructionInfoSecondTriggerIsSum */
    {
        .index                        = 0x4019u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.modulator.p_output.currentReconstructionInfo.secondTriggerIsSum),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.modulator)
    },
    /* IDX 0x4100: Motorcontrol/g_fluxEstimatorParam/samplingTime */
    {
        .index                        = 0x4100u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .uMin_DU                      = 1u,
        .uMax_DU                      = 65535u,
        .uMin_TU                      = 1u,
        .uMax_TU                      = 65535u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.samplingTime_us),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setSamplingTime,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4101: Motorcontrol/g_fluxEstimatorParam/alphaFilterTimeConstant */
    {
        .index                        = 0x4101u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 4294967295u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.alphaFilter_timeConstant_us),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setAlphaTimeConstant,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4102: Motorcontrol/g_fluxEstimatorParam/betaFilterTimeConstant */
    {
        .index                        = 0x4102u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 4294967295u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.betaFilter_timeConstant_us),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setBetaTimeConstant,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4103: Motorcontrol/g_fluxEstimatorParam/speedFilterTimeConstant */
    {
        .index                        = 0x4103u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 4294967295u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.speedFilter_timeConstant_us),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setSpeedFilterTimeConstant,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4104: Motorcontrol/g_fluxEstimatorParam/pllFilterPropGain */
    {
        .index                        = 0x4104u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147483647u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 2147483647u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.pllFilter_propGain),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setPllFilterPropGain,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4106: Motorcontrol/g_fluxEstimatorParam/phaseRes */
    {
        .index                        = 0x4106u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 4800u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.phaseResQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setPhaseRes,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4107: Motorcontrol/g_fluxEstimatorParam/phaseIndAdjusted */
    {
        .index                        = 0x4107u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -32768,
        .sMax_TU                      = 32767,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.phaseIndAdjustedQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_setPhaseIndAdjusted,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4108: Motorcontrol/g_fluxEstimatorParam/alphaGainAdjusted */
    {
        .index                        = 0x4108u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -32768,
        .sMax_TU                      = 32767,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.alphaGainAdjustedQ14),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4109: Motorcontrol/g_fluxEstimatorParam/betaGainAdjusted */
    {
        .index                        = 0x4109u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -32768,
        .sMax_TU                      = 32767,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_fluxEstimatorParam.betaGainAdjustedQ14),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4110: Motorcontrol/g_fluxEstimatorParam/speed */
    {
        .index                        = 0x4110u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.fluxEstimator.p_output.speedQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4111: Motorcontrol/g_fluxEstimatorParam/anglePll */
    {
        .index                        = 0x4111u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 62832u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.fluxEstimator.p_output.anglePLL),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4112: Motorcontrol/g_fluxEstimatorParam/mode */
    {
        .index                        = 0x4112u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.fluxEstimator.p_mode),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MDA_FluxEstimator_F16_getMode,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.fluxEstimator)
    },
    /* IDX 0x4200: Motorcontrol/g_focControllerParam/currentDPiIntegGainSamplingTime */
    {
        .index                        = 0x4200u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418112u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1048544000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentDPiIntegGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentDPiIntegGainSamplingTime,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4201: Motorcontrol/g_focControllerParam/currentDPiLowerLimit */
    {
        .index                        = 0x4201u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 0,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 0,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentDPiLowerLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentDPiLowerLimit,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4202: Motorcontrol/g_focControllerParam/currentDPiUpperLimit */
    {
        .index                        = 0x4202u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentDPiUpperLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentDPiUpperLimit,
