Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Cfg/Ifx_FRW_ParamTable_Cfg.c
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4203: Motorcontrol/g_focControllerParam/currentDPiPropGain */
    {
        .index                        = 0x4203u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418111u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 157281600u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentDPiPropGain),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentDPiPropGain,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4204: Motorcontrol/g_focControllerParam/currentDPiAntiWindupGainSamplingTime */
    {
        .index                        = 0x4204u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418111u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 436893333u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentDPiAntiWindupGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4205: Motorcontrol/g_focControllerParam/currentQPiIntegGainSamplingTime */
    {
        .index                        = 0x4205u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418112u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1048544000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentQPiIntegGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentQPiIntegGainSamplingTime,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4206: Motorcontrol/g_focControllerParam/currentQPiLowerLimit */
    {
        .index                        = 0x4206u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 0,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 0,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentQPiLowerLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentQPiLowerLimit,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4207: Motorcontrol/g_focControllerParam/currentQPiUpperLimit */
    {
        .index                        = 0x4207u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentQPiUpperLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentQPiUpperLimit,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4208: Motorcontrol/g_focControllerParam/currentQPiPropGain */
    {
        .index                        = 0x4208u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418111u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 157281600u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentQPiPropGain),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MDA_FocController_F16_setCurrentQPiPropGain,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4209: Motorcontrol/g_focControllerParam/currentQPiAntiWindupGainSamplingTime */
    {
        .index                        = 0x4209u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147418111u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 436893333u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focControllerParam.currentQPiAntiWindupGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4210: Motorcontrol/g_focControllerParam/dAntiwindupCtrl */
    {
        .index                        = 0x4210u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 2u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.p_dAntiwindupCtrl),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4211: Motorcontrol/g_focControllerParam/qAntiwindupCtrl */
    {
        .index                        = 0x4211u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 2u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.p_qAntiwindupCtrl),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4212: Motorcontrol/g_focControllerParam/currentDqReal */
    {
        .index                        = 0x4212u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -5000,
        .sMax_TU                      = 5000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.currentDQ.real),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4213: Motorcontrol/g_focControllerParam/currentDqImag */
    {
        .index                        = 0x4213u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -5000,
        .sMax_TU                      = 5000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.currentDQ.imag),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4214: Motorcontrol/g_focControllerParam/voltageCommandPolarAmplitude */
    {
        .index                        = 0x4214u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -32767,
        .sMax_TU                      = 32767,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.p_output.voltageCommandPolar.amplitude),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4215: Motorcontrol/g_focControllerParam/voltageCommandPolarAngle */
    {
        .index                        = 0x4215u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 62832u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.focController.p_output.voltageCommandPolar.angle),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.focController)
    },
    /* IDX 0x4312: Motorcontrol/g_iToFParam/currentVecAngle */
    {
        .index                        = 0x4312u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 62832u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.iToF.p_output.currentVecAngle_rad),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.iToF)
    },
    /* IDX 0x4401: Motorcontrol/g_vToFControllerParam/ratedSpeed */
    {
        .index                        = 0x4401u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_vToFControllerParam.VToFLUTnorm.ratedSpeedQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4402: Motorcontrol/g_vToFControllerParam/cornerSpeed */
    {
        .index                        = 0x4402u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_vToFControllerParam.VToFLUTnorm.cornerSpeedQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4403: Motorcontrol/g_vToFControllerParam/cornerVolt */
    {
        .index                        = 0x4403u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_vToFControllerParam.VToFLUTnorm.cornerVoltQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4404: Motorcontrol/g_vToFControllerParam/minVolt */
    {
        .index                        = 0x4404u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_vToFControllerParam.VToFLUTnorm.minVoltQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4405: Motorcontrol/g_vToFControllerParam/ratedVolt */
    {
        .index                        = 0x4405u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_vToFControllerParam.VToFLUTnorm.ratedVoltQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4410: Motorcontrol/g_vToFControllerParam/voltageVectorAmplitude */
    {
        .index                        = 0x4410u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.vToF.p_output.voltageVector.amplitude),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x4411: Motorcontrol/g_vToFControllerParam/voltageVectorAngle */
    {
        .index                        = 0x4411u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 4294967295u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 62832u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.vToF.p_output.voltageVector.angle),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop.vToF)
    },
    /* IDX 0x5000: Motorcontrol/g_focSolutionParam/startUpCurrent */
    {
        .index                        = 0x5000u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.startUpCurrentQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getStartUpCurrent,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setStartUpCurrent,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5001: Motorcontrol/g_focSolutionParam/startUpCurrentRampUpRate */
    {
        .index                        = 0x5001u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 3331,
