Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Cfg/Ifx_FRW_ParamTable_Cfg.c
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.startUpCurrentRampUpRateQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setStartUpCurrentRampUpRate,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5002: Motorcontrol/g_focSolutionParam/speedPiPropGain */
    {
        .index                        = 0x5002u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147483647u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 2684355u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedPiPropGain),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedPiPropGain,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedPiPropGain,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5003: Motorcontrol/g_focSolutionParam/speedPiIntegGainSamplingTime */
    {
        .index                        = 0x5003u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147483647u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1787780136u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedPiIntegGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedPiIntegGainSamplingTime,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedPiIntegGainSamplingTime,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5004: Motorcontrol/g_focSolutionParam/refCurrentUpperLimit */
    {
        .index                        = 0x5004u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.refCurrentUpperLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setRefCurrentUpperLimit,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5005: Motorcontrol/g_focSolutionParam/refCurrentLowerLimit */
    {
        .index                        = 0x5005u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.refCurrentLowerLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setRefCurrentLowerLimit,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5006: Motorcontrol/g_focSolutionParam/refSpeedUpperLimit */
    {
        .index                        = 0x5006u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.refSpeedUpperLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getRefSpeedUpperLimit,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setRefSpeedUpperLimit,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5007: Motorcontrol/g_focSolutionParam/refSpeedLowerLimit */
    {
        .index                        = 0x5007u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.refSpeedLowerLimitQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getRefSpeedLowerLimit,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setRefSpeedLowerLimit,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5008: Motorcontrol/g_focSolutionParam/minimumSpeedThreshold */
    {
        .index                        = 0x5008u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.minimumSpeedThresholdQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5009: Motorcontrol/g_focSolutionParam/speedRampUpRateOpenLoop */
    {
        .index                        = 0x5009u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 2147483647,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 5329780u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedRampUpRateOpenLoopQ30),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedRampUpRateOpenLoop,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedRampUpRateOpenLoop,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500A: Motorcontrol/g_focSolutionParam/speedRampDownRateOpenLoop */
    {
        .index                        = 0x500Au,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 2147483647,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 5329780u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedRampDownRateOpenLoopQ30),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedRampDownRateOpenLoop,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedRampDownRateOpenLoop,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500B: Motorcontrol/g_focSolutionParam/speedRampUpRateClosedLoop */
    {
        .index                        = 0x500Bu,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 2147483647,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 5329780u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedRampUpRateClosedLoopQ30),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedRampUpRateClosedLoop,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedRampUpRateClosedLoop,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500C: Motorcontrol/g_focSolutionParam/speedRampDownRateClosedLoop */
    {
        .index                        = 0x500Cu,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 2147483647,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 5329780u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedRampDownRateClosedLoopQ30),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getSpeedRampDownRateClosedLoop,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setSpeedRampDownRateClosedLoop,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500D: Motorcontrol/g_focSolutionParam/qCurrentAtTransition */
    {
        .index                        = 0x500Du,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.qCurrentAtTransitionQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getQCurrentAtTransition,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setQCurrentAtTransition,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500E: Motorcontrol/g_focSolutionParam/transitionAngleTolerance */
    {
        .index                        = 0x500Eu,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 16384,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 9000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.transitionAngleTolerance),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getTransitionAngleTolerance,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setTransitionAngleTolerance,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x500F: Motorcontrol/g_focSolutionParam/transitionTimeLimit */
    {
        .index                        = 0x500Fu,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 1u,
        .uMax_DU                      = 65535u,
        .uMin_TU                      = 2u,
        .uMax_TU                      = 98368u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.transitionTimeLimit_cycles),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getTransitionTimeLimit,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setTransitionTimeLimit,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5010: Motorcontrol/g_focSolutionParam/transitionDownDCurrentScaling */
    {
        .index                        = 0x5010u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 2000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.transitionDownDCurrentScalingQ14),
        .maxSubIndex                  = 0u,
        .getParam                     = (functionPointer)Ifx_MS_FocSolution_F16_getTransitionDownDCurrentScalingQ14,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setTransitionDownDCurrentScalingQ14,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5011: Motorcontrol/g_focSolutionParam/transitionSpeedUp */
    {
        .index                        = 0x5011u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.transitionSpeedUpQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setTransitionSpeedUp,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5012: Motorcontrol/g_focSolutionParam/transitionSpeedBand */
    {
        .index                        = 0x5012u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 10000u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.transitionSpeedBandQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = (functionPointer)Ifx_MS_FocSolution_F16_setTransitionSpeedBand,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5014: Motorcontrol/g_focSolutionParam/frictionConstant */
    {
        .index                        = 0x5014u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = 0,
        .sMax_DU                      = 32767,
        .sMin_TU                      = 0,
        .sMax_TU                      = 1711,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.frictionConstant),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5016: Motorcontrol/g_focSolutionParam/initStartupCurrent */
    {
        .index                        = 0x5016u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32767,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -10000,
        .sMax_TU                      = 10000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.initStartupCurrentQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5017: Motorcontrol/g_focSolutionParam/speedPiAntiWindupGain */
    {
        .index                        = 0x5017u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 3u,
        .bits.sizeTU                  = 3u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 2147483647u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 357675490u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_focSolutionParam.speedPiAntiWindupGainSamplingTime),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5020: Motorcontrol/g_focSolutionParam/state */
    {
        .index                        = 0x5020u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 6u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 6u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.p_status.state),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5021: Motorcontrol/g_focSolutionParam/subState */
    {
        .index                        = 0x5021u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
