Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Cfg/Ifx_FRW_ParamTable_Cfg.c
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 3u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 3u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.p_status.subState),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5022: Motorcontrol/g_focSolutionParam/actualControlMode */
    {
        .index                        = 0x5022u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(FocDemoClosedLoop.p_status.actualControlMode),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5023: Motorcontrol/g_focSolutionParam/estimatedSpeed */
    {
        .index                        = 0x5023u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 0u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -32768,
        .sMax_DU                      = 32767,
        .sMin_TU                      = -4000,
        .sMax_TU                      = 4000,
        .bits.multiInstance           = 1u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(FocDemoClosedLoop.p_output.estimatedSpeedQ15),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = (void*) &(FocDemoClosedLoop)
    },
    /* IDX 0x5100: Motorcontrol/g_mctrlExampleParam/enableControl */
    {
        .index                        = 0x5100u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_mctrlExampleParam.enableControl),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    },
    /* IDX 0x5101: Motorcontrol/g_mctrlExampleParam/enablePowerStage */
    {
        .index                        = 0x5101u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_mctrlExampleParam.enablePowerStage),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    },
    /* IDX 0x5102: Motorcontrol/g_mctrlExampleParam/rotorAlignmentTime */
    {
        .index                        = 0x5102u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 43686u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 6553u,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_mctrlExampleParam.rotorAlignmentTime_ticks),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    },
    /* IDX 0x5104: Motorcontrol/g_mctrlExampleParam/controlMode */
    {
        .index                        = 0x5104u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 0u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 2u,
        .address                      = (void *) &(g_mctrlExampleParam.controlMode),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    },
    /* IDX 0x5105: Motorcontrol/g_mctrlExampleParam/clrFaultFoc */
    {
        .index                        = 0x5105u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 0u,
        .bits.isSignedTU              = 0u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 0u,
        .bits.sizeTU                  = 0u,
        .uMin_DU                      = 0u,
        .uMax_DU                      = 1u,
        .uMin_TU                      = 0u,
        .uMax_TU                      = 1u,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_mctrlExampleParam.clrFaultFoc),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    },
    /* IDX 0x5106: Motorcontrol/g_mctrlExampleParam/referenceSpeed */
    {
        .index                        = 0x5106u,
        .bits.readAccess              = 1u,
        .bits.writeAccess             = 1u,
        .bits.isSignedDU              = 1u,
        .bits.isSignedTU              = 1u,
        .bits.changeWhileMotorRunning = 1u,
        .bits.sizeDU                  = 1u,
        .bits.sizeTU                  = 1u,
        .sMin_DU                      = -4000,
        .sMax_DU                      = 4000,
        .sMin_TU                      = -4000,
        .sMax_TU                      = 4000,
        .bits.multiInstance           = 0u,
        .bits.parameterType           = 0u,
        .address                      = (void *) &(g_mctrlExampleParam.referenceSpeed_rpm),
        .maxSubIndex                  = 0u,
        .getParam                     = NULL,
        .setParam                     = NULL,
        .instance                     = NULL
    }
    
};
/* *INDENT-ON* */